---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.SpatialFieldManager
source: html/4e1d669e-d74d-6082-787d-7d0aaaa57643.htm
---
# SpatialFieldManager Methods

Creates empty analysis results primitive not associated with any geometry element